reviews/1-response.tex
% Created 2024-02-27 Tue 11:51
% Intended LaTeX compiler: pdflatex
\documentclass[11pt,a4paper,final]{article}
\usepackage[a4paper, total={7in, 10in}]{geometry}
\usepackage{algorithm2e}
\usepackage{booktabs}
\usepackage{subcaption}
\usepackage{graphicx}
\usepackage{tikz}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Alexander Brown}
\date{\today}
\title{Response To Reviewers}
\hypersetup{
 pdfauthor={Alexander Brown},
 pdftitle={Response To Reviewers},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.6.6)},
 pdflang={English}}
\begin{document}

\maketitle
Thank you for taking the time to thoroughly review our manuscript and provide us the chance to submit a revised version.
The time and effort dedicated in providing this insightful feedback has contributed greatly to the quality of this
work. We have incorporated all of the suggestions made by the reviewer. Said changes are represented by the blue text
embedded within the manuscript. Below is a point-by-point response to the reviewers comments are presented. Relevant
sections are mentioned when applicable to assist in searching for the associated changes.

\section{Reviewer's Comments to the Authors}
\label{sec:org262d0f1}

The article is on an interesting topic of scheduling charging visits by battery electric busses. A modified formulation
based on berth allocation problem is proposed for allocating busses to chargers. While the topic is interesting the
description of the formulation is not coherrent. It may be of great help to the reader if the following points are
addressed before the article is published.

\begin{quote}
  \textcolor{blue}{Thank you! The points given were of great help in improving our document.}
\end{quote}

\begin{itemize}
\item Mathematical notations should be properly denoted and introduced coherently in the discussion for the ease of understanding. For example, authors could follow the standard definitions sets, parameters, and variables using mathematical notation to describe the formulation.
\end{itemize}

\begin{quote}
  \textcolor{blue}{Thank you very much for your thorough review. We have revisited the introduction of each variable. We have also clarified the discussions, provided examples, and stated units where applicable.}
\end{quote}

\begin{itemize}
\item Consider adding the reference model to the appendix. This will allow the authors to describe the proposed model is more detail by explaining the underlying notations and assumptions.
\end{itemize}

\begin{quote}
\textcolor{blue}{Thank you for this suggestion. In the end, we decided to keep the manuscript development as is. The rationale being that the formulations are similar between the BAP, PAP, and the newly derived work. We decided that the developments of this work are more clearly represented when they are posed as changes to the previous work. We have made a significant effort to clarify notation to make the underlying explanation and assumptions more clear.}
\end{quote}

\begin{itemize}
\item TYPO: Section -2, list of parameters, both \(n_V\) and \(n_N\) are used to denote the same thing, which appears to be a typographical error.
\end{itemize}

\begin{quote}
\textcolor{blue}{Thank you for noticing this mistake. There was a migration of variable notation in the previous manuscript, and we did not catch all the changes prior to submission. We have now updated everything to use $n_V$.}
\end{quote}

\begin{itemize}
\item Section -1, \(n_C\) is introduced as number of chargers without explaining the need for it and then it doesn’t appear anywhere else in the formulation.
\end{itemize}

\begin{quote}
\textcolor{blue}{Thank you for pointing this out. While $n_C$ was being utilized, it was not clearly stated when it was being applied. We have made efforts to clarify when this variable is utilized.}
\end{quote}

\begin{itemize}
\item Section -1, “The variable \(S\) is likewise replaced with …” there is no variable \(S\) in the referred formulation.
\end{itemize}

\begin{quote}
\textcolor{blue}{This is another migration of notation issue. The variable $S$ has been replaced with $L$ throughout the document. We appreciate attention detail taken to find this problem.}
\end{quote}

\begin{itemize}
\item Rationale for additional queues is not evident, further explanation would be useful for the readers. E.g., why the proposed methodology is chosen over having one additional charger with charge rate = 0
\end{itemize}


\begin{quote}
\textcolor{blue}{Thank you for pointing out that this concept is not clear. We have added more explanation to Section 3 about the rationale for multiple waiting queues. The reason for multiple waiting queues is that multiple buses could be waiting at the same exact time. The mathematical formulation does not allow them to be in a single queue with an overlapping time window. We have created a waiting queue for each bus as the extreme condition where all buses are in the station, but do not need to charge.}
\end{quote}

\begin{itemize}
\item Certain critical assumptions like fixed charge and discharge rates is only stated in the results (section -1). This should be stated before the formulation itself.
\end{itemize}

\begin{quote}
\textcolor{blue}{We appreciate your feedback. An effort to explain these critical assumptions is presented in the introductory paragraphs of Section 3. The assumptions discussed are: BEB discharges are pre-calculated and are assumed fixed and the difference in SOC at the beginning of the day is assumed to be higher than that of the end of the working day. Thus, the difference in SOC is assumed to be recuperated overnight.}
\end{quote}

\begin{itemize}
\item Some notations are not clear. For example, \(i\) is a parameter defined as discharge, but only the discharge rate was assumed to be fixed, and the duration is a variable.
\end{itemize}

\begin{quote}
\textcolor{blue}{Thank you for pointing this out. We have performed a thorough review of the manuscript to ensure that variables and units are clear. Note that $i$ is an indexing variable. The variables associated with charge are:}

\begin{itemize}
\item \textcolor{blue}{$\alpha_b$ \%: Initial charge percentage}
\item \textcolor{blue}{$\beta_b$ \%: Final charge percentage}
\item \textcolor{blue}{$\nu_b$ \%: Minimum intermediate charge percentage allowed}
\item \textcolor{blue}{$\kappa_b$ kWh: Battery capacity}
\item \textcolor{blue}{$\zeta_b$ kW: Discharge rate for BEB}
\item \textcolor{blue}{$\Delta_i$ kWh: Discharge over route}
\end{itemize}
\end{quote}

\begin{itemize}
\item Other units that are not clear include charge gain variable ‘g’, what units does it have?
\end{itemize}

\begin{quote}
\textcolor{blue}{Thank you for pointing out this confusion for the reader. To address the question, $g$ has units of seconds. We have made significant efforts in clarifying the units of each variable that is introduced, as well as listed the units of each variable in Table 1 of the manuscript.}
\end{quote}
\end{document}
